[
  {
    "id": "1",
    "title": "HTML5",
    "text": "<h4>História:</h4> Com o surgimento da web, era necessário criar uma linguagem que fosse entendida por meios de acesso diferentes. Para tanto, Tim Berners-Lee desenvolveu o <b>HTML</b>, com a proposta de suprir essa necessidade. Somente na década de 90, quando o Mosaic (browser desenvolvido por Marc Andreessen) e se popularizou, o HTML ganhou força e foi adotado por outros desenvolvedores e fabricante de browsers, compartilhando as mesmas convenções. <br/> HTML é uma abreviação de <i><b>Hypertext Markup Language</b></i>, tradução: <b>Linguagem de Marcação de Hipertexto</b>. O HTML é uma linguagem usada para a publicação de conteúdo não só de texto, mas também imagens, vídeos, áudios, PDF's e etc. <br/> Em 2004, foi fundado o <i><b>WHATWG</b> (Web Hypertext Application Technology Working Group)</i> por desenvolvedores de empresas como Mozilla, Apple e Opera, onde se iniciou o trabalho de escrever a nova versão do HTML, que seria chamado hoje de <b>HTML5</b>. <br/> <br/> <h4>Na disciplina:</h4> Além de aprendermos sobre a história, apredemos a codificar em HTML na versão mais atual, aprendemos sobre a estrutura básica da linguagem, as tags mais importantes, boas práticas e etc. No fim, para a construção de WEB sites refinados e estilosos, somente com a linguagem de marcação não se é possível, pôs com essa linguagem só é posssível criar a estruturação do nosso site, ela estabelece todo o conteúdo visível que irá aparecer quando o arquivo for rederizado no <i>browser</i>.",
    "datapost": "12 de Abril de 2021",
    "image": "img/img-html.png",
    "autor": "Severino Neto"
  },
  {
    "id": "2",
    "title": "CSS",
    "text": "<h4>O que é CSS?</h4> <b>CSS</b> é chamado de linguagem <i><b>Cascading Style Sheet</b></i> e é usado para estilizar elementos escritos em uma linguagem de marcação como <b>HTML</b>. O CSS separa o conteúdo da representação visual do site. Pense  na decoração da sua página. Utilizando o CSS é possível alterar a cor do texto e do fundo, fonte e espaçamento entre parágrafos. Também pode criar tabelas, usar variações de layouts, ajustar imagens para suas respectivas telas e assim por diante. O CSS foi desenvolvido pelo <b>W3C</b> <i>(World Wide Web Consortium)</i> em 1996, por uma razão bem simples. O HTML não foi projetado para ter tags que ajudariam a formatar a página. Você deveria apenas escrever a marcação para o site. <br/> A relação entre HTML e CSS é bem forte. Como o HTML é uma linguagem de marcação (o alicerce de um site) e o CSS é focado no estilo (toda a estética de um site), eles andam juntos. <br/> CSS não é tecnicamente uma necessidade, mas provavelmente você não gostaria de olhar para um site que usa apenas HTML, pois isso pareceria completamente abandonado. <br/><br/> <h4>Na disciplina:</h4> Aprendemos sobre os tipos de seletores dos elementos HTML presente na página para estilizarmos da maneira que nos convém, aprendemos também sobre as propriedades mais utilizadas para modificar elementos, e também sobre os valores que essas propriedades são atribuídas. <br/> Fizemos um projeto com os conteúdos estudados, e vejo que melhorei bastante de lá para cá (kkk).",
    "datapost": "11 de Abril de 2021",
    "image": "img/img-css.png",
    "autor": "Severino Neto"
  },
  {
    "id": "3",
    "title": "JavaScript",
    "text": "<h4>Sobre JavaScript: </h4> <b>JavaScript</b> é uma linguagem de programação que permite a você implementar itens complexos em páginas web. Toda vez que uma página da web faz mais do que simplesmente mostrar a você informação estática, mostrando conteúdo que se atualiza em um intervalo de tempo, mapas interativos ou gráficos 2D/3D animados, etc, você pode apostar que o <b>JavaScript</b> provavelmente está envolvido. É a terceira camada do bolo das tecnologias padrões da web, duas das quais <b>(HTML e CSS)</b> nós citamos sobre. <br/><br/> <h4>Na disciplina:</h4> Diante de tudo o que aconteceu por causa da pandêmia, penso eu que foi pouco tempo e conteúdos mostrados sobre uma linguagem de programação tão rica e prazerosa de se trabalhar. Mesmo com tudo isso, foi mostrado o lado do JS que fuinciona ao lado do cliente, nas páginas web que serão renderizadas pelos browsers de quem acessa. <br/> <h5>Assuntos:</h5> <ul><li>Tipos primitivos</li><li>Manipulação de dados</li><li>Functions</li><li>Arrow Functions</li></ul>",
    "datapost": "10 de Abril de 2021",
    "image": "img/img-js.png",
    "autor": "Severino Neto"
  },
  {
    "id": "4",
    "title": "Jquery",
    "text": "Uma das bobliotecas JS mais utilizadas, o Jquery tem como função ajudar no desenvolvimento de sites, facilitando a manipulação do <b>Document Object Model (DOM)</b>. Esse foi um conteúdo extra da disciplina",
    "datapost": "09 de Abril de 2021",
    "image": "img/img-jquery.png",
    "autor": "Severino Neto"
  },
  {
    "id": "5",
    "title": "Bootstrap",
    "text": "<b>Bootstrap</b> é um <i>framework</i> para a internet <b>open-source</b> que nos auxilia na construção de sites responsivos com sua abordagem <u>mobile first</u>. Ele possue um conjunto de códigos <b>CSS</b> e <b>JS</b> que fazem o estilo e ações de vários componentes do mesmo, deixando somente que o programador escolha as classes com aquelas ações e estilos",
    "datapost": "08 de Abril de 2021",
    "image": "img/img-bootstrap-5-1.png",
    "autor": "Severino Neto"
  }
]