[
  {
    "id": "1",
    "title": "HTML5",
    "text": "<h4>História:</h4> Com o surgimento da web, era necessário criar uma linguagem que fosse entendida por meios de acesso diferentes. Para tanto, Tim Berners-Lee desenvolveu o <b>HTML</b>, com a proposta de suprir essa necessidade. Somente na década de 90, quando o Mosaic (browser desenvolvido por Marc Andreessen) e se popularizou, o HTML ganhou força e foi adotado por outros desenvolvedores e fabricante de browsers, compartilhando as mesmas convenções. <br/> HTML é uma abreviação de <i><b>Hypertext Markup Language</b></i>, tradução: <b>Linguagem de Marcação de Hipertexto</b>. O HTML é uma linguagem usada para a publicação de conteúdo não só de texto, mas também imagens, vídeos, áudios, PDF's e etc. <br/> Em 2004, foi fundado o <i><b>WHATWG</b> (Web Hypertext Application Technology Working Group)</i> por desenvolvedores de empresas como Mozilla, Apple e Opera, onde se iniciou o trabalho de escrever a nova versão do HTML, que seria chamado hoje de <b>HTML5</b>.  <br/><hr> <h4>Na disciplina:</h4> Além de aprendermos sobre a história, apredemos a codificar em HTML na versão mais atual, aprendemos sobre a estrutura básica da linguagem, as tags mais importantes, boas práticas e etc. No fim, para a construção de WEB sites refinados e estilosos, somente com a linguagem de marcação não se é possível, pôs com essa linguagem só é posssível criar a estruturação do nosso site, ela estabelece todo o conteúdo visível que irá aparecer quando o arquivo for rederizado no <i>browser</i>.",
    "datapost": "12 de Abril de 2021",
    "image": "img/img-html.png",
    "autor": "Severino Neto"
  },
  {
    "id": "2",
    "title": "CSS",
    "text": "<h4>O que é CSS?</h4> <b>CSS</b> é chamado de linguagem <i><b>Cascading Style Sheet</b></i> e é usado para estilizar elementos escritos em uma linguagem de marcação como <b>HTML</b>. O CSS separa o conteúdo da representação visual do site. Pense  na decoração da sua página. Utilizando o CSS é possível alterar a cor do texto e do fundo, fonte e espaçamento entre parágrafos. Também pode criar tabelas, usar variações de layouts, ajustar imagens para suas respectivas telas e assim por diante. O CSS foi desenvolvido pelo <b>W3C</b> <i>(World Wide Web Consortium)</i> em 1996, por uma razão bem simples. O HTML não foi projetado para ter tags que ajudariam a formatar a página. Você deveria apenas escrever a marcação para o site. <br/> A relação entre HTML e CSS é bem forte. Como o HTML é uma linguagem de marcação (o alicerce de um site) e o CSS é focado no estilo (toda a estética de um site), eles andam juntos. <br/> CSS não é tecnicamente uma necessidade, mas provavelmente você não gostaria de olhar para um site que usa apenas HTML, pois isso pareceria completamente abandonado.  <br/><hr> <h4>Na disciplina:</h4> Aprendemos sobre os tipos de seletores dos elementos HTML presente na página para estilizarmos da maneira que nos convém, aprendemos também sobre as propriedades mais utilizadas para modificar elementos, e também sobre os valores que essas propriedades são atribuídas. <br/> Fizemos um projeto com os conteúdos estudados, e vejo que melhorei bastante de lá para cá (kkk).",
    "datapost": "11 de Abril de 2021",
    "image": "img/img-css.png",
    "autor": "Severino Neto"
  },
  {
    "id": "3",
    "title": "JavaScript",
    "text": "<h4>Sobre JavaScript: </h4> <b>JavaScript</b> é uma linguagem de programação que permite a você implementar itens complexos em páginas web. Toda vez que uma página da web faz mais do que simplesmente mostrar a você informação estática, mostrando conteúdo que se atualiza em um intervalo de tempo, mapas interativos ou gráficos 2D/3D animados, etc, você pode apostar que o <b>JavaScript</b> provavelmente está envolvido. É a terceira camada do bolo das tecnologias padrões da web, duas das quais <b>(HTML e CSS)</b> nós citamos sobre.  <br/><hr> <h4>Na disciplina:</h4> Diante de tudo o que aconteceu por causa da pandêmia, penso eu que foi pouco tempo e conteúdos mostrados sobre uma linguagem de programação tão rica e prazerosa de se trabalhar. Mesmo com tudo isso, foi mostrado o lado do JS que fuinciona ao lado do cliente, nas páginas web que serão renderizadas pelos browsers de quem acessa. <br/> <h5>Assuntos:</h5> <ul><li>Tipos primitivos</li><li>Manipulação de dados</li><li>Functions</li><li>Arrow Functions</li></ul>",
    "datapost": "10 de Abril de 2021",
    "image": "img/img-js.png",
    "autor": "Severino Neto"
  },
  {
    "id": "4",
    "title": "Jquery",
    "text": "<h4>O que é Jquery?</h4> <b>JQuery</b> é uma <b>biblioteca</b> popular do <b>JavaScript</b>. Ela foi criado por <b>John Resig</b> em 2006 com o propósito de facilitar a vida dos desenvolvedores que usam JavaScript nos seus sites. Não é uma linguagem de programação separada, funciona em conjunto com o JavaScript. Com jQuery, você vai conseguir fazer muito mais com menos, pôs eventos, funções, animações e outra grama de coisas já estão prontas, você só precisa saber como colocar e da melhor forma em seu código. Criar códigos pode ser um pouco cansativo, especialmente quando isso envolve muitas strings. A jQuery compacta várias linhas de código em uma única função. Assim, você não precisa reescrever todos os blocos repetidamente para concluir sua tarefa. <br/><hr> <h4>Na disciplina:</h4> Esse foi um assunto no qual foi extra, não foi exigido em nenhum trabalho, pôs por causa da pândemia ficou muito corrido e para estudar a fundo essa biblioteca seria complicado.",
    "datapost": "09 de Abril de 2021",
    "image": "img/img-jquery.png",
    "autor": "Severino Neto"
  },
  {
    "id": "5",
    "title": "Bootstrap",
    "text": "O <b>Bootstrap</b> é um framework <b>front-end</b> gratuito e de código-fonte aberto, que disponibiliza componentes prontos para você utilizar em seu projeto. Com ele, você consegue criar e personalizar sites responsivos para dispositivos móveis, desktops e notebooks, com componentes pré-construídos e com plugins JavaScript poderosos. Tudo isso porque toda a estrutura do <b>HTML, CSS e Javascript</b> já se encontram prontas, bastando apenas que o desenvolvedor importe suas dependências em seu projeto. <br/> Por exemplo: se você quer colocar em seu site um botão estilizado, você pode utilizar o componente button do Bootstrap diretamente, ou mesmo fazer pequenas customizações no componente para que ele tenha a aparência desejada. Com estes componentes pré-prontos, você ganha tempo, o que consequentemente faz com que seu projeto seja finalizado mais rapidamente, com menos esforço e até mesmo com mais qualidade. <br/> Primeiramente, o Bootstrap foi desenvolvido pelo Twitter, onde inicialmente era apenas um projeto para padronizar o desenvolvimento dentro da própria empresa. Porém, no meio do desenvolvimento do projeto, a equipe percebeu o potencial que este framework tinha para impactar e trazer benefícios para a comunidade. Dessa maneira, ele foi liberado em 2011 já como um projeto open source, ou seja, para que os outros desenvolvedores pudessem contribuir. De lá pra cá, nesse meio tempo, foram muitas mudanças até chegar sua atual versão 5, que possui inúmeras novidades tanto nos componentes CSS quanto nos componentes JavaScript. <br/><hr> <h4>Na disciplina:</h4> Esse foi um assunto extra, foi passao um trabalho no qual era preciso fazer um site usando essa tecnologia. Eu tentei usar todos os meus conhecimentos com <b>HTML, CSS, JavaScript</b> e o próprio <b>Bootstrap</b>. Infelismente não fechei o trabalho final por causa de coisa besta, não comentei algumas linhas de códigos do meu código css que estilizava alguns componentes do site",
    "datapost": "08 de Abril de 2021",
    "image": "img/img-bootstrap-5-1.png",
    "autor": "Severino Neto"
  }
]